cf_billing/Enums/энргВидыОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>энргВидыОпераций</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>УдалитьэнргПерерасчет_КорректировкаПоказаний</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_ВосстановлениеИзЗабалансаФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_СписаниеНаЗабалансФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ОтменаРегистрации</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_РегистрацияЛьготы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_РегистрацияПоСтроению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ЗакрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_ОткрытиеЛС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСЛС_СменаСобственника</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчета_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаМКД_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ОтключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСРазделеннымиЛС_ПодключениеАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиМКД_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Закрытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОткрытиеМКД_Открытие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ВозвратСредствПотребителю</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_НеправильноРаспределеннаяОплата</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПереносОплаты_ПереносМеждуЛицевымиСчетами</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_БлокировочныйАкт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ИзменениеПризнакаНаличияПрибораСНачалаГода</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_КорректировкаОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_СписаниеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_ИзменениеПараметраРассчета</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_КорректировкаПотребленногоОбъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_РучнойПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчетМКД_СвязанныйПерерасчет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьДатуПоверкиПУ_СвязанныеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Извещение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Предупреждение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_РешениеСуда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭтапПретензионноИсковойДеятельности_Уведомление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_ИндивидуальныйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>бестИзменитьСпособДоставкиЕПДАбонентам_МассовыйВвод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ЗакрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОтключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ОткрытиеПомещения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацииСПомещениями_ПодключениеАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ВыводПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСПриборомУчетаПомещения_ЗаменаПУ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ОтключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугамиПомещений_ПодключениеУслуги</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПерерасчетНенадлежащегоКачества</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ОбщаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргНастройкаРассрочки_ИндивидуальнаяНастройка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_ПереносВозвратОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргБанкротство_МассовоеСписание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОбходнойЛист_ЗагрузкаПоказанийИзВнешнихИсточников</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ОграничениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргОперацияСУслугами_ВозобновлениеРежимаПотребления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Подключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргАктНесанкционированногоПодключенияВмешательства_Вмешательство</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_РегистрацияПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияПретензийОтПотребителяИсполнителя_АннулированиеПретензии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргПерерасчет_РаспределениеЗадолженности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_ПериодОтсутствия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

cf_billing/CommonModules/энргРаботаСВидамиОперацийСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьСписокВозможныхОперацийФормаСписка(ИмяДокумента,СписокОпераций) Экспорт
	
	Если ИмяДокумента = "энргОперацияСЛицевымСчетом" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС,											"Открытие лицевого счета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС,											"Закрытие лицевого счета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника,									"Смена собственника лицевого счета");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСПриборомУчета" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ,									"Акт ввода прибора учета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ,									"Акт вывода прибора учета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ,									"Акт замены прибора учета");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугами" тогда
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1", ИмяДокумента));
		врСписокОпераций 	= МенеджерОбъекта.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого врЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(врЗначениеСписка.Значение, врЗначениеСписка.Представление);
		КонецЦикла;
		
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги,								"Подключение услуги");
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги,								"Отключение услуги");		
		//
		//// ОРП
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления,					Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргОперацияСУслугами_ОграничениеРежимаПотребления.Синоним);
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления,					Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргОперацияСУслугами_ВозобновлениеРежимаПотребления.Синоним);		
		//// ОРП
		
	ИначеЕсли ИмяДокумента = "энргЭтапПретензионноИсковойДеятельности" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Уведомление,						"Уведомление");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Извещение,						"Извещение");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Предупреждение,					"Предупреждение");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам,	"Передача пакета документов юристам");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_РешениеСуда,						"Решение суда");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста,	"Регистрация исполнительного листа");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугамиМКД" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги,							"Подключение услуги многоквартирному дому");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ОтключениеУслуги,							"Отключение услуги многоквартирному дому");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСПриборомУчетаМКД" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ,									"Ввод общедомового прибора учета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ,								"Вывод общедомового прибора учета");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ,								"Замена общедомового прибора учета");
		
	ИначеЕсли ИмяДокумента = "энргОткрытиеМКД" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие,												"Открытие многоквартирного дома");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие,												"Закрытие многоквартирного дома");
		
	ИначеЕсли ИмяДокумента = "энргПерерасчет" тогда
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСписокОпераций 	= МенеджерОбъекта.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого врЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(врЗначениеСписка.Значение, врЗначениеСписка.Представление);
		КонецЦикла;
		
	ИначеЕсли ИмяДокумента = "энргПерерасчетМКД" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_ИзменениеПараметраРассчета,							Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргПерерасчетМКД_ИзменениеПараметраРассчета.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет,								"Связанный перерасчет");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_РучнойПерерасчет,									"Ручной перерасчет");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг,		Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_КорректировкаПотребленногоОбъема,					Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргПерерасчетМКД_КорректировкаПотребленногоОбъема.Синоним);
		
		
		//ИначеЕсли ИмяДокумента = "энргРеструктуризацияЗадолженности" тогда
		//	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс,					"Списание задолженности на забалансовые счета");
		//	СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности,	"Списание задолженности с забалансовых счетов");	
		
	ИначеЕсли ИмяДокумента = "энргРегистрацияПоказанийАбонента" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема,		"Регистрация контрольного съема");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента,		"Регистрация показаний предоставленных абонентом");	
		
	ИначеЕсли ИмяДокумента = "энргОперацияСРазделеннымиЛС" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСРазделеннымиЛС_ПодключениеАбонента,						"Подключение абонента к помещению с разделенными ЛС ");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСРазделеннымиЛС_ОтключениеАбонента,						"Отключение абонента от помещения с разделенными ЛС ");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугамиТеплоисточника" тогда                                  		
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги,				"Подключение услуги теплоисточника");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги,					"Отключение услуги теплоисточника");
		
	ИначеЕсли ИмяДокумента = "энргОперацииСПериодамиОспариванияЗадолженности" тогда                                  		
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов,		"Регистрация периодов оспаривания задолженности");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов,	"Снятие регистрации периодов оспаривания задолженности");
		
	ИначеЕсли ИмяДокумента = "энргИзменениеЛьготыЖильцам" тогда
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1", ИмяДокумента));
		врСписокОпераций 	= МенеджерОбъекта.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого врЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(врЗначениеСписка.Значение, врЗначениеСписка.Представление);
		КонецЦикла;
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_РегистрацияЛьготы,							"Регистрация льготы");
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_ОтменаРегистрации,							"Отмена льготы");
		////СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_ИзменениеКатегорииЛьготы,					"Изменение категории");	
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменениеЛьготыЖильцам_ЗагрузкаРеестраЕИРЦ,						"Загрузка реестра из ЕИРЦ");
		
		
	ИначеЕсли ИмяДокумента = "энргПереносОплаты" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПереносОплаты_ПереносМеждуЛицевымиСчетами,						"Перенос между лицевыми счетами");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргПереносОплаты_НеправильноРаспределеннаяОплата,					"Неправильно распределенная оплата");	
		
	ИначеЕсли  ИмяДокумента = "энргАктированиеНедопускаДопускаВПомещение" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение,	"Актирование допуска в помещение");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение,"Актирование недопуска в помещение");	
		
	ИначеЕсли  ИмяДокумента = "энргОбходнойЛист" тогда
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1", ИмяДокумента));
		врСписокОпераций 	= МенеджерОбъекта.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого врЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(врЗначениеСписка.Значение, врЗначениеСписка.Представление);
		КонецЦикла;
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОбходнойЛист_МассовыйВвод			,			"Массовый ввод");
		//СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОбходнойЛист_РегистрацияПоСтроению, 			"Регистрация по строению");
		
	ИначеЕсли  ИмяДокумента = "энргБанкротство" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ			, 		"Списание на забаланс ФЛ");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргБанкротство_ВосстановлениеИзЗабалансаФЛ		, 	"Восстановление из забаланса ФЛ");		
		
	ИначеЕсли  ИмяДокумента = "энргИзменитьНомерПломбыПрибораУчетаАбоненты" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка.Синоним);
		
	ИначеЕсли  ИмяДокумента = "энргИзменитьНомерПломбыПрибораУчетаМКД" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка	, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка	, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы	, Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы.Синоним);
		
	ИначеЕсли  ИмяДокумента = "энргОперацияСТочкамиПоставки" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки		, 	"Включение точки поставки");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки		, 	"Отключение точки поставки");
		
	ИначеЕсли  ИмяДокумента = "энргУстановитьТочкиПоставкиНаТочкиУчета" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД				, 	"Установить точки поставки на точки учета МКД");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов		, 	"Установить точки поставки на точки учета абонентов");
		
	ИначеЕсли  ИмяДокумента = "энргАктНесанкционированногоПодключенияВмешательства" тогда	
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Вмешательство		, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргАктНесанкционированногоПодключенияВмешательства_Вмешательство.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Подключение		, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргАктНесанкционированногоПодключенияВмешательства_Подключение.Синоним);
		
	ИначеЕсли  ИмяДокумента = "энргКорректировкаПениПоСудебномуРешению" тогда	
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению		, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени					, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени.Синоним);	
		
	ИначеЕсли  ИмяДокумента = "энргРегистрацияПретензийОтПотребителяИсполнителя" Тогда 	
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1", ИмяДокумента));
		врСписокОпераций 	= МенеджерОбъекта.ЗаполнитьСписокВозможныхОперацийФормаСписка();
		Для Каждого врЗначениеСписка Из врСписокОпераций Цикл
			СписокОпераций.Добавить(врЗначениеСписка.Значение, врЗначениеСписка.Представление);
		КонецЦикла;
		
	ИначеЕсли  ИмяДокумента = "энргСоглашениеПоРассрочке" тогда	
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ		, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ.Синоним);
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ			, 	Метаданные.Перечисления.энргВидыОпераций.ЗначенияПеречисления.СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ.Синоним);
		
	ИначеЕсли  ИмяДокумента = "энргРегистрацияРасчетаПениАбонента" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента				, 	"Исключение расчета пени");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента		, 	"Возобновление расчета пени");
		
	ИначеЕсли ИмяДокумента = "энргРегистрацияВременногоОтсутствия" тогда
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияВременногоОтсутствия_ПериодОтсутствия,					"Период отсутствия");
		СписокОпераций.добавить(Перечисления.энргВидыОпераций.энргРегистрацияВременногоОтсутствия_КорректировкаПериодаОтсутствия,	"Корректировка периода отсутствия"); 	
		
	КонецЕсли;
	
КонецПроцедуры

Функция ПрефиксФормы(ИмяДокумента,ВыбранноеЗначение) Экспорт
	Соотвествие  		= Новый Соответствие;
	Если ИмяДокумента = "энргОперацияСЛицевымСчетом" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ОткрытиеЛС,											"ОткрытиеЛС");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_ЗакрытиеЛС,                                          "ЗакрытиеЛС");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСЛС_СменаСобственника,                                   "СменаСобственника");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугами" Тогда
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСоотвествие 		= МенеджерОбъекта.СоотвествиеВидовОперацииИПрефиксовФорм();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие, врСоотвествие, Истина);
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ПодключениеУслуги,								"ПодключениеУслуги");
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОтключениеУслуги,								"ОтключениеУслуги");		
		//
		//// ОРП
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ОграничениеРежимаПотребления,					"ОтключениеУслуги");
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугами_ВозобновлениеРежимаПотребления,				"ОтключениеУслуги");
		//// ОРП
		
	ИначеЕсли ИмяДокумента = "энргОперацияСПриборомУчета" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВводПУ,									"ВводПУ");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ВыводПУ,									"ВыводПУ");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчета_ЗаменаПУ,									"ЗаменаПУ");
		
	ИначеЕсли ИмяДокумента = "энргЭтапПретензионноИсковойДеятельности" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Уведомление,						"Уведомление");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Извещение,						"Извещение");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_Предупреждение,					"Предупреждение");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_ПередачаПакетаДокументовЮристам,	"ПередачаПакетаДокументовЮристам");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_РешениеСуда,						"РешениеСуда");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.ЭтапПретензионноИсковойДеятельности_РегистрацияИсполнительногоЛиста,	"РегистрацияИсполнительногоЛиста");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугамиМКД" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ПодключениеУслуги,							"ПодключениеУслуги");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиМКД_ОтключениеУслуги,							"ОтключениеУслуги");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСПриборомУчетаМКД" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВводПУ,								"ВводПУ");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ВыводПУ,								"ВыводПУ");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСПриборомУчетаМКД_ЗаменаПУ,								"ЗаменаПУ");
		
	ИначеЕсли ИмяДокумента = "энргОткрытиеМКД" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОткрытиеМКД_Открытие,											"ОткрытиеМКД");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОткрытиеМКД_Закрытие,											"ЗакрытиеМКД");
		
	ИначеЕсли ИмяДокумента = "энргПерерасчет" тогда
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСоотвествие 		= МенеджерОбъекта.СоотвествиеВидовОперацииИПрефиксовФорм();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие,врСоотвествие,Истина);
		
	ИначеЕсли ИмяДокумента = "энргПерерасчетМКД" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_ИзменениеПараметраРассчета,						"ИзменениеПараметраРассчета");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_СвязанныйПерерасчет,								"СвязанныйПерерасчет");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_РучнойПерерасчет,									"РучнойПерерасчет");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_КорректировкаГодовогоПотребленияСезонныхУслуг,		"КорректировкаПотребленияСезонныхУслуг");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПерерасчетМКД_КорректировкаПотребленногоОбъема,					"КорректировкаПотребленногоОбъема");
		
		//ИначеЕсли ИмяДокумента = "энргРеструктуризацияЗадолженности" тогда
		//	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРеструктуризацияЗадолженности_СписаниеНаЗабаланс,				"СписаниеНаЗабаланс");
		//	Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРеструктуризацияЗадолженности_СписаниеЗабалансовойЗадолженности,	"СписаниеЗабалансовойЗадолженности");	
		
	ИначеЕсли ИмяДокумента = "энргРегистрацияПоказанийАбонента" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияКонтрольногоСъема,		"");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРегистрацияПоказанийАбонента_РегистрацияПоказанийАбонента,		"");	
		
	ИначеЕсли ИмяДокумента = "энргОперацияСРазделеннымиЛС" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСРазделеннымиЛС_ПодключениеАбонента,						"ПодключениеАбонентов");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСРазделеннымиЛС_ОтключениеАбонента,						"ОтключениеАбонентов");
		
	ИначеЕсли ИмяДокумента = "энргОперацияСУслугамиТеплоисточника" тогда                                  		
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиТеплоисточника_ПодключениеУслуги,				"ПодключениеУслуги");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСУслугамиТеплоисточника_ОтключениеУслуги,				"ОтключениеУслуги");
		
	ИначеЕсли ИмяДокумента = "энргОперацииСПериодамиОспариванияЗадолженности" тогда                                  		
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацииСПериодамиОспариванияЗадолженности_РегистрацияПериодов,			"РегистрацияПериодов");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацииСПериодамиОспариванияЗадолженности_СнятиеРегистрацииПериодов,	"СнятиеРегистрацииПериодов");
		
	ИначеЕсли ИмяДокумента = "энргИзменениеЛьготыЖильцам" тогда
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСоотвествие 		= МенеджерОбъекта.СоотвествиеВидовОперацииИПрефиксовФорм();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие,врСоотвествие,Истина);
		
	ИначеЕсли ИмяДокумента = "энргПереносОплаты" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПереносОплаты_НеправильноРаспределеннаяОплата,						"НеправильноРаспределеннаяОплата");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргПереносОплаты_ПереносМеждуЛицевымиСчетами,							"ПереносМеждуЛицевымиСчетами");	
		
	ИначеЕсли  ИмяДокумента = "энргАктированиеНедопускаДопускаВПомещение" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеДопускаВПомещение,	"");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргАктированиеНедопускаДопускаВПомещение_АктированиеНедопускаВПомещение,"");	
		
	ИначеЕсли  ИмяДокумента = "энргОбходнойЛист" или  ИмяДокумента = "энргЗагрузкаПоказанийИзВнешнихИсточников" тогда
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСоотвествие 		= МенеджерОбъекта.СоотвествиеВидовОперацииИПрефиксовФорм();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие, врСоотвествие, Истина);
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОбходнойЛист_МассовыйВвод											, "МассовыйВвод");
		//Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОбходнойЛист_РегистрацияПоСтроению									, "РегистрацияПоСтроению");
		
	ИначеЕсли  ИмяДокумента = "энргБанкротство" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргБанкротство_СписаниеНаЗабалансФЛ			, "СписаниеНаЗабаланс");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргБанкротство_ВосстановлениеИзЗабалансаФЛ	, "ВосстановлениеИзЗабаланса");
		
	ИначеЕсли  ИмяДокумента = "энргИзменитьНомерПломбыПрибораУчетаАбоненты" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Опломбировка, 	"Опломбировка");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_ЗаменаПломбы, 	"ЗаменаПломбы");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаАбоненты_Распломбировка, 	"Распломбировка");
		
	ИначеЕсли  ИмяДокумента = "энргИзменитьНомерПломбыПрибораУчетаМКД" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Опломбировка, 	"Опломбировка");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_ЗаменаПломбы, 	"ЗаменаПломбы");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргИзменитьНомерПломбыПрибораУчетаМКД_Распломбировка, 	"Распломбировка");
		
	ИначеЕсли  ИмяДокумента = "энргОперацияСТочкамиПоставки" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ВключениеТочкиПоставки, 	"ВключениеТочкиПоставки");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргОперацияСТочкамиПоставки_ОтключениеТочкиПоставки, 	"ОтключениеТочкиПоставки");
		
	ИначеЕсли  ИмяДокумента = "энргУстановитьТочкиПоставкиНаТочкиУчета" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаМКД, 			"УстановитьНаТочкиУчетаМКД");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргУстановитьТочкиПоставкиНаТочкиУчета_УстановитьНаТочкиУчетаАбонентов, 	"УстановитьНаТочкиУчетаАбонентов");
		
	ИначеЕсли  ИмяДокумента = "энргАктНесанкционированногоПодключенияВмешательства" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Вмешательство, "");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргАктНесанкционированногоПодключенияВмешательства_Подключение	, "");		
		
	ИначеЕсли  ИмяДокумента = "энргКорректировкаПениПоСудебномуРешению" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргКорректировкаПениПоСудебномуРешению_КорректировкаПениПоСудебномуРешению, "");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргКорректировкаПениПоСудебномуРешению_РучнаяКорректировкаПени	, "");
		
	ИначеЕсли  ИмяДокумента = "энргРегистрацияПретензийОтПотребителяИсполнителя" Тогда 	
		
		МенеджерОбъекта 	= ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(СтрШаблон("Документ.%1",ИмяДокумента));
		врСоотвествие 		= МенеджерОбъекта.СоотвествиеВидовОперацииИПрефиксовФорм();
		ОбщегоНазначенияКлиентСервер.ДополнитьСоответствие(Соотвествие, врСоотвествие, Истина);
		
	ИначеЕсли  ИмяДокумента = "энргСоглашениеПоРассрочке" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_РеструктуризацияЗадолженностиФЛ		, "ФЛ");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.СоглашениеПоРассрочке_ЗакрытиеЗадолженностиФЛ		, "ФЛ");
		
		
	ИначеЕсли  ИмяДокумента = "энргРегистрацияРасчетаПениАбонента" тогда
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРегистрацияРасчетаПениАбонента_ИсключениеРасчетаПениАбонента, "");
		Соотвествие.Вставить(Перечисления.энргВидыОпераций.энргРегистрацияРасчетаПениАбонента_ВозобновлениеРасчетаПениАбонента	, "");
		
		
	КонецЕсли;  
	
	Возврат Соотвествие[ВыбранноеЗначение]; 
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПараметрыВидаОперции() Экспорт
	
	ПараметрыВида = Новый Структура;
	ПараметрыВида.Вставить("Вид");
	ПараметрыВида.Вставить("ИмяДокумента");	
	Возврат ПараметрыВида;
	
КонецФункции

Функция ПрефиксФормыПоОснованию(ИмяДокумента,ТипОснования) Экспорт
	
	Если ИмяДокумента = "энргПерерасчет" тогда				
		Возврат "ИзменениеПараметраРассчета"; 				
	КонецЕсли;   
	
КонецФункции

Процедура УстановитьСвойстваВидаОперации(Параметры)  Экспорт
	
	Если ТипЗнч(Параметры.Вид) = Тип("Строка") Тогда
		Объект 				= Справочники.энргВидыОпераций[Параметры.Вид].ПолучитьОбъект();
	Иначе
		Объект 				= Параметры.Вид.ПолучитьОбъект();
	КонецЕсли;
	
	Объект.ИмяДокумента   	= Параметры.ИмяДокумента;
	
	ОбновлениеИнформационнойБазы.ЗаписатьДанные(Объект);
КонецПроцедуры

#КонецОбласти
